IvanovDmitriy09/Eclipse_templates/Gigadevice/GD32E50x/system/src/cmsis/vectors_gd32e50x.c
#ifdef GD32EPRT
        WWDGT_IRQHandler,                  // Window Watchdog Timer
        LVD_IRQHandler,                    // LVD through EXTI Line detect
        TAMPER_IRQHandler,                 // Tamper through EXTI Line detect
        RTC_IRQHandler,                    // RTC through EXTI Line
        FMC_IRQHandler,                    // FMC
        RCU_CTC_IRQHandler,                // RCU and CTC
        EXTI0_IRQHandler,                  // EXTI Line 0
        EXTI1_IRQHandler,                  // EXTI Line 1
        EXTI2_IRQHandler,                  // EXTI Line 2
        EXTI3_IRQHandler,                  // EXTI Line 3
        EXTI4_IRQHandler,                  // EXTI Line 4
        DMA0_Channel0_IRQHandler,          // DMA0 Channel0
        DMA0_Channel1_IRQHandler,          // DMA0 Channel1
        DMA0_Channel2_IRQHandler,          // DMA0 Channel2
        DMA0_Channel3_IRQHandler,          // DMA0 Channel3
        DMA0_Channel4_IRQHandler,          // DMA0 Channel4
        DMA0_Channel5_IRQHandler,          // DMA0 Channel5
        DMA0_Channel6_IRQHandler,          // DMA0 Channel6
        ADC0_1_IRQHandler,                 // ADC0 and ADC1
        USBD_HP_IRQHandler,                // USBD HP
        USBD_LP_IRQHandler,                // USBD LP
        0,                                 // Reserved
        0,                                 // Reserved
        EXTI5_9_IRQHandler,                // EXTI5 to EXTI9
        TIMER0_BRK_IRQHandler,             // TIMER0 Break
        TIMER0_UP_IRQHandler,              // TIMER0 Update
        TIMER0_TRG_CMT_IRQHandler,         // TIMER0 Trigger and Commutation
        TIMER0_Channel_IRQHandler,         // TIMER0 Channel Capture Compare
        TIMER1_IRQHandler,                 // TIMER1
        TIMER2_IRQHandler,                 // TIMER2
        TIMER3_IRQHandler,                 // TIMER3
        I2C0_EV_IRQHandler,                // I2C0 Event
        I2C0_ER_IRQHandler,                // I2C0 Error
        I2C1_EV_IRQHandler,                // I2C1 Event
        I2C1_ER_IRQHandler,                // I2C1 Error
        SPI0_IRQHandler,                   // SPI0
        SPI1_I2S1ADD_IRQHandler,           // SPI1 or I2S1ADD
        USART0_IRQHandler,                 // USART0
        USART1_IRQHandler,                 // USART1
        USART2_IRQHandler,                 // USART2
        EXTI10_15_IRQHandler,              // EXTI10 to EXTI15
        RTC_Alarm_IRQHandler,              // RTC Alarm
        USBD_WKUP_IRQHandler,              // USBD Wakeup
        TIMER7_BRK_IRQHandler,             // TIMER7 Break
        TIMER7_UP_IRQHandler,              // TIMER7 Update
        TIMER7_TRG_CMT_IRQHandler,         // TIMER7 Trigger and Commutation
        TIMER7_Channel_IRQHandler,         // TIMER7 Channel Capture Compare
        ADC2_IRQHandler,                   // ADC2
        EXMC_IRQHandler,                   // EXMC
        0,                                 // Reserved
        TIMER4_IRQHandler,                 // TIMER4
        SPI2_I2S2ADD_IRQHandler,           // SPI2 or I2S2ADD
        UART3_IRQHandler,                  // UART3
        UART4_IRQHandler,                  // UART4
        TIMER5_DAC_IRQHandler,             // TIMER5 or DAC
        TIMER6_IRQHandler,                 // TIMER6
        DMA1_Channel0_IRQHandler,          // DMA1 Channel0
        DMA1_Channel1_IRQHandler,          // DMA1 Channel1
        DMA1_Channel2_IRQHandler,          // DMA1 Channel2
        DMA1_Channel3_4_IRQHandler,        // DMA1 Channel3 and Channel4
        0,                                 // Reserved
        ENET_IRQHandler,                   // Ethernet
        ENET_WKUP_IRQHandler,              // Ethernet Wakeup through EXTI Line
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        0,                                 // Reserved
        I2C2_EV_IRQHandler,                // I2C2 Event
        I2C2_ER_IRQHandler,                // I2C2 Error
        USART5_IRQHandler,                 // USART5
        I2C2_WKUP_IRQHandler,              // I2C2 Wakeup
        USART5_WKUP_IRQHandler,            // USART5 Wakeup
        0,                                 // Reserved
#endif

    };

// ----------------------------------------------------------------------------

// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.

void __attribute__ ((section(".after_vectors")))
Default_Handler(void)
{
  while (1)
    {
	  ;
    }
}

// ----------------------------------------------------------------------------
